Catalogs/абс_Города/абс_Города.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_Города</name>
  <owners>Catalog.абс_Регионы</owners>
  <attributes>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГородаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

InformationRegisters/АдресныйКлассификатор/АдресныйКлассификатор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АдресныйКлассификатор</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>52</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АльтернативныеНазвания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРегионаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодРайонаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодГородаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодНаселенногоПунктаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодУлицыВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Код</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/абс_Регионы/абс_Регионы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_Регионы</name>
  <comment>Регионы</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Комментарий</name>
    <comment>Комментарий</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодРегиона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодАдресногоЭлемента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЖДСтанцияНазначения</name>
    <comment>Железнодорожная станция назначения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_КодРегионаВКоде</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Catalogs/абс_Города/ManagerModule.bsl
Процедура ЗаполнитьПоКлассификаторуАдресов() Экспорт

	Запрос = Новый Запрос( 
	"ВЫБРАТЬ
	|	АдресныйКлассификатор.КодРегионаВКоде КАК КодРегиона,
	|	АдресныйКлассификатор.Наименование КАК НаименованиеРегиона,
	|	АдресныйКлассификатор.КодРегионаВКоде КАК абс_КодРегионаВКоде,
	|	Регионы.Ссылка КАК РегионСсылка
	|ПОМЕСТИТЬ ВТ_Регионы
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_Регионы КАК Регионы
	|		ПО АдресныйКлассификатор.КодРегионаВКоде = Регионы.абс_КодРегионаВКоде
	|ГДЕ
	|	АдресныйКлассификатор.КодРайонаВКоде = 0
	|	И АдресныйКлассификатор.КодГородаВКоде = 0
	|	И АдресныйКлассификатор.КодНаселенногоПунктаВКоде = 0
	|	И АдресныйКлассификатор.КодУлицыВКоде = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АдресныйКлассификатор.КодГородаВКоде,
	|	АдресныйКлассификатор.Наименование,
	|	АдресныйКлассификатор.Сокращение,
	|	АдресныйКлассификатор.Наименование + "" "" + АдресныйКлассификатор.Сокращение КАК НаименованиеПолное,
	|	ВТ_Регионы.КодРегиона,
	|	ВТ_Регионы.НаименованиеРегиона,
	|	ВТ_Регионы.абс_КодРегионаВКоде,
	|	ВТ_Регионы.РегионСсылка
	|ПОМЕСТИТЬ ВТ_КладрРегионы
	|ИЗ
	|	РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Регионы КАК ВТ_Регионы
	|		ПО АдресныйКлассификатор.КодРегионаВКоде = ВТ_Регионы.абс_КодРегионаВКоде
	|ГДЕ
	|	АдресныйКлассификатор.КодУлицыВКоде = 0
	|	И АдресныйКлассификатор.КодГородаВКоде <> 0
	|	И АдресныйКлассификатор.Сокращение = ""г""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КладрРегионы.КодГородаВКоде,
	|	ВТ_КладрРегионы.Наименование,
	|	ВТ_КладрРегионы.Сокращение,
	|	ВТ_КладрРегионы.НаименованиеПолное,
	|	ВТ_КладрРегионы.КодРегиона,
	|	ВТ_КладрРегионы.НаименованиеРегиона,
	|	ВТ_КладрРегионы.абс_КодРегионаВКоде,
	|	ВТ_КладрРегионы.РегионСсылка,
	|	абс_Города.Ссылка КАК ГородСсылка
	|ИЗ
	|	ВТ_КладрРегионы КАК ВТ_КладрРегионы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.абс_Города КАК абс_Города
	|		ПО ВТ_КладрРегионы.РегионСсылка = абс_Города.Владелец
	|			И ВТ_КладрРегионы.КодГородаВКоде = абс_Города.КодГородаВКоде");
	
	ТЗГородов = Запрос.Выполнить().Выгрузить();
	
	СоответствиеРегионов = Новый Соответствие();
	
	Для Каждого СтрПоГороду Из ТЗГородов Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрПоГороду.РегионСсылка) Тогда
			
			СтрПоГороду.РегионСсылка = СоответствиеРегионов.Получить(СтрПоГороду.абс_КодРегионаВКоде);
			
			Если НЕ ЗначениеЗаполнено(СтрПоГороду.РегионСсылка) Тогда
				СтрПоГороду.РегионСсылка = Справочники.абс_Регионы.СоздатьОбновитьРегион(Новый Структура("КодРегиона,Наименование,абс_КодРегионаВКоде,РегионСсылка", СтрПоГороду.КодРегиона, СтрПоГороду.НаименованиеРегиона, СтрПоГороду.абс_КодРегионаВКоде, СтрПоГороду.РегионСсылка));
				
				СоответствиеРегионов.Вставить(СтрПоГороду.абс_КодРегионаВКоде, СтрПоГороду.РегионСсылка);
			КонецЕсли;
		КонецЕсли;
		
		СоздатьОбновитьГород(СтрПоГороду);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьГород(ДанныеПоГороду) Экспорт
	
	ГородОбъект = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеПоГороду.ГородСсылка) Тогда		
		ГородОбъект = ДанныеПоГороду.ГородСсылка.ПолучитьОбъект();
	Иначе
		ГородОбъект = Справочники.абс_Города.СоздатьЭлемент();
	КонецЕсли;
		
	ЗаполнитьЗначенияСвойств(ГородОбъект, ДанныеПоГороду);	
	
	ГородОбъект.Владелец = ДанныеПоГороду.РегионСсылка;
	
	ГородОбъект.ОбменДанными = Истина;
	
	ГородОбъект.Записать();
	
	ОбщегоНазначения.СообщитьИнформациюПользователю("Город """ + ДанныеПоГороду.Наименование + """ " + ?(ЗначениеЗаполнено(ДанныеПоГороду.ГородСсылка), "обновлен", "создан") + "!");
	
	Возврат ГородОбъект.Ссылка;		
	
КонецФункции
